Exercise 1
elow are various data sources. Identify whether each one is an example of structured or unstructured data.

A companyâ€™s financial reports stored in an Excel file.  => structured data
Photographs uploaded to a social media platform.        => unstructured data
A collection of news articles on a website              => unstructured data
Inventory data in a relational database                 =structured data
Recorded interviews from a market research study.       => unstructured data

Exercise 2
For each of the following unstructured data sources, propose a method to convert it into structured data. Explain your reasoning.

1 A series of blog posts about travel experiences.
    Blog posts could be given a mark, from 1 to 10, for instance, depending on the interest of the travel they are documenting, and that could create an array of travel experiences, from totally uninteresting to really interesting
    
2 Audio recordings of customer service calls.
    Audio recordings of customer service calls could be sorted in two (2) categories depending on the fact that the customer's problem has been solved (1) or not(0)
    
3 Handwritten notes from a brainstorming session.
    THe handwritten notes of a brainstorming session could be sorted by subject dealt with during the brainstorming session and set aside accordingly, each subject in a separate row or column.

4 A video tutorial on cooking.
    It would be possible to sort the different parts of a cooking tutorial by stage of the tutorial or the recipe, each part being aasociated with a number.

Exercice 3

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Exercice 4

In [5]:
df_iris = pd.read_csv('Iris.csv')

In [6]:
df = pd.read_csv('Iris.csv')

In [7]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

Exercice 5

In [9]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Paris', 'London']
}

In [10]:
df = pd.DataFrame(data)

# Export to Excel
df.to_excel('output.xlsx', index=False)

Exercice 6

In [27]:
df = pd.read_json('posts.json')

In [28]:
df.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...